Revit 2025 API
ZoneEquipmentBehavior Enumeration
 The behavior of zone equipment associated with spaces.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ZoneEquipmentBehavior
Public Enumeration ZoneEquipmentBehavior
public enum class ZoneEquipmentBehavior
type ZoneEquipmentBehavior
Members
Member name | Value | Description
OnePerSpace | 0
GroupSpaces | 1
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace